# ScheduleFieldId Class

---
The ScheduleFieldId object is used as a unique identification for a field in a schedule.
SystemObject Autodesk.Revit.DBScheduleFieldId
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ScheduleFieldId

    Public Class ScheduleFieldId

    public ref class ScheduleFieldId

    type ScheduleFieldId = class end
The ScheduleFieldId type exposes the following members.
| Name| Description
---|---|---
| ScheduleFieldId| Initializes a new instance of the ScheduleFieldId class
Top
| Name| Description
---|---|---
| IntegerValue|  Provides the value of the ScheduleFieldId as an integer.
| InvalidScheduleFieldId|  Get the invalid ScheduleFieldId whose IntegerValue is -1.
Top
| Name| Description
---|---|---
| Equals|  Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object))
| GetHashCode|  Gets the integer value of the id as hash code (Overrides ObjectGetHashCode)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString|  Gets a String representation of the integer value of the id. (Overrides ObjectToString)
Top
| Name| Description
---|---|---
| Equality(ScheduleFieldId, ScheduleFieldId)| Determines whether two ScheduleFieldIds are the same.
| Inequality(ScheduleFieldId, ScheduleFieldId)| Determines whether two ScheduleFieldId are different.
Top
#### Reference
Autodesk.Revit.DB Namespace